Revit 2024 API
BuiltInFailures.GroupFailures.UnableToGroupElems Property
 Revit does not allow grouping of some of the selected elements. These elements will not be included in the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableToGroupElems { get; }
Visual Basic
Public Shared ReadOnly Property UnableToGroupElems As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableToGroupElems {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace